dhzl84/ESP8266-Smart-Home/src/main.cpp
/*===================================================================================================================*/
/* includes */
/*===================================================================================================================*/
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include "ESP8266WebServer.h"
#include <ESP8266mDNS.h>
#include <DHTesp.h>
#include <osapi.h>   /* for sensor timer */
#include <os_type.h> /* for sensor timer */
#include "UserFonts.h"
#include <SSD1306.h>
#include "MQTTClient.h"
#include <ESP8266httpUpdate.h>
#include <ArduinoOTA.h>

#include "main.h"
#include "version.h"
#include "cThermostat.h"
#include "cMQTT.h"

/*===================================================================================================================*/
/* GPIO config */
/*===================================================================================================================*/
ADC_MODE(ADC_VCC);             /* measure Vcc */
#define DHT_PIN              2 /* sensor */
#define SDA_PIN              4 /* I²C */
#define SCL_PIN              5 /* I²C */
#define PHYS_INPUT_1_PIN    12 /* rotary left/right OR down/up */
#define PHYS_INPUT_2_PIN    13 /* rotary left/right OR down/up */
#define PHYS_INPUT_3_PIN    14 /* on/off/ok/reset */
#define RELAY_PIN           16 /* relay control */

/*===================================================================================================================*/
/* variables, constants, types, classes, etc. definitions */
/*===================================================================================================================*/
uint32_t WiFiConnectCounter = 0;
uint32_t MQTTConnectCounter = 0;
/* config */
struct configuration myConfig;
/* mqtt */
#ifndef MQTT_QOS
  #define MQTT_QOS 1 /* valid values are 0, 1 and 2 */
#endif
uint32_t mqttReconnectTime       = 0;
uint32_t mqttReconnectInterval   = MQTT_RECONNECT_TIME;
uint32_t mqttPubCycleTime        = 0;
#define secondsToMillisecondsFactor  1000
#define minutesToMillisecondsFactor 60000
/* loop handler */
#define loop50ms        50
#define loop100ms      100
#define loop500ms      500
#define loop1000ms    1000
uint32_t loop50msMillis   =  0;
uint32_t loop100msMillis  = 22; /* start loops with some offset to avoid calling all loops every second */
uint32_t loop500msMillis  = 44; /* start loops with some offset to avoid calling all loops every second */
uint32_t loop1000msMillis = 66; /* start loops with some offset to avoid calling all loops every second */
/* HTTP Update */
bool fetchUpdate = false;       /* global variable used to decide whether an update shall be fetched from server or not */
/* OTA */
typedef enum otaUpdate { TH_OTA_IDLE, TH_OTA_ACTIVE, TH_OTA_FINISHED, TH_OTA_ERROR } OtaUpdate_t;       /* global variable used to change display in case OTA update is initiated */
OtaUpdate_t OTA_UPDATE = TH_OTA_IDLE;
/* rotary encoder / push buttons */
uint32_t  onOffButtonDebounceTime        = 0;
#if CFG_PUSH_BUTTONS
uint32_t  upButtonDebounceTime           = 0;
uint32_t  downButtonDebounceTime         = 0;
#else
#define rotLeft                                 -1
#define rotRight                                1
#define rotInit                                 0
volatile int16_t lastEncoded                      = 0b11;        /* initial state of the rotary encoders gray code */
volatile int16_t rotaryEncoderDirectionInts       = rotInit;     /* initialize rotary encoder with no direction */
#endif /* CFG_PUSH_BUTTONS */
uint32_t buttonDebounceInterval         = 250;
uint32_t onOffButtonSystemResetTime     = 0;
uint32_t onOffButtonSystemResetInterval = 10000;

#define tempStep              5
#define displayTemp           0
#define displayHumid          1
/* sensor */
uint32_t readSensorScheduled = 0;
/* Display */
#define drawTempYOffset       16
#define drawTargetTempYOffset 0
#define drawHeating drawXbm(0, drawTempYOffset, myThermo_width, myThermo_height, myThermo)
/* classes */
DHTesp            myDHT;
SSD1306           myDisplay(0x3c, SDA_PIN, SCL_PIN);
WiFiClient        myWiFiClient;
Thermostat        myThermostat;
MQTTClient        myMqttClient(1024); /* 1024 byte buffer */
mqttHelper        myMqttHelper;
ESP8266WebServer  webServer(80);

bool     systemRestartRequest = false;
bool     nameChanged = false;
uint32_t wifiReconnectTimer = 30000;

#define  SPIFFS_MQTT_ID_FILE        String("/itsme")
#define  SPIFFS_SENSOR_CALIB_FILE   String("/sensor")
#define  SPIFFS_TARGET_TEMP_FILE    String("/targetTemp")
#define  SPIFFS_WRITE_DEBOUNCE      20000 /* write target temperature to spiffs if it wasn't changed for 20 s (time in ms) */
boolean  SPIFFS_WRITTEN =           true;
uint32_t SPIFFS_REFERENCE_TIME;



/*===================================================================================================================*/
/* The setup function is called once at startup of the sketch */
/*===================================================================================================================*/
void setup() {
  #ifdef CFG_DEBUG
  Serial.begin(115200);
  Serial.println("Serial connection established");
  #endif

  SPIFFS_INIT();                                                                                   /* read stuff from SPIFFS */
  GPIO_CONFIG();                                                                                   /* configure GPIOs */
  myThermostat.setup(RELAY_PIN, myConfig.tTemp, myConfig.calibF, myConfig.calibO, myConfig.tHyst); /* GPIO to switch the connected relay, initial target temperature, sensor calbigration and thermostat hysteresis */
  myDHT.setup(DHT_PIN, DHTesp::DHT22);                                                             /* init DHT sensor */
  DISPLAY_INIT();                                                                                  /* init Display */
  WIFI_CONNECT();                                                                                  /* connect to WiFi */
  OTA_INIT();
  myMqttHelper.setup();                                                       /* build MQTT topics based on the defined device name */
  MQTT_CONNECT(); /* connect to MQTT host and build subscriptions, must be called after SPIFFS_INIT()*/

  MDNS.begin(strlwr(myConfig.name));
  webServer.begin();
  webServer.on("/", handleWebServerClient);

  #if CFG_PUSH_BUTTONS
  attachInterrupt(PHYS_INPUT_1_PIN, upButton,   FALLING);
  attachInterrupt(PHYS_INPUT_2_PIN, downButton, FALLING);
  attachInterrupt(PHYS_INPUT_3_PIN, onOffButton, FALLING);
  #else
  /* enable interrupts on encoder pins to decode gray code and recognize switch event*/
  attachInterrupt(PHYS_INPUT_1_PIN, updateEncoder, CHANGE);
  attachInterrupt(PHYS_INPUT_2_PIN, updateEncoder, CHANGE);
  attachInterrupt(PHYS_INPUT_3_PIN, onOffButton,   FALLING);
  #endif /* CFG_PUSH_BUTTONS */

  SENSOR_MAIN(); /* acquire first sensor data before staring loop() to avoid relay toggle due to current temperature being 0 °C (init value) until first sensor value is read */

  #ifdef CFG_DEBUG
  Serial.println("Reset Reason: " + String(ESP.getResetReason()));
  Serial.println("Flash Size: " + String(ESP.getFlashChipRealSize()));
  Serial.println("Sketch Size: " + String(ESP.getSketchSize()));
  Serial.println("Free for Sketch: " + String(ESP.getFreeSketchSpace()));
  Serial.println("Free Heap: " + String(ESP.getFreeHeap()));
  Serial.println("Vcc: " + String(ESP.getVcc() / 1000.0));
  #endif
}

/*===================================================================================================================*/
/* functions called by setup()                                                                                       */
/*===================================================================================================================*/

